ekrats/SC0X_Monitor/bsp/stm32f40x/userApp/canApp.cpp
	{PORT2, CAN_RX_DIRC, CAN_ID_M1,      CAN_ID_AD,  CAN_FUNC_AD_POLL,    		16,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.AD_RxChnn,   (uint8_t *)&can.scData->canAppBuf.AD_RxChnn,    		can.MsgRx_Deal},	
		
};

//static __IO STD_MSG_CON_TB *_std_msg = _std_msg_table;

CanApp::CanApp(void)
{
	_std_msg = _std_msg_table;
	
	CanStateWord = 0x000F;
	
	canOffTime = 200;
}

/****************************************************************
* Function Name  : StdMsgRx_Common_cb
* Description    : 接收控制板状态数据处理 
*                   
* Input          : None
* Output         : None
* Return         : None
*****************************************************************/
void CanApp::MsgRx_Deal(CAN_RX_DATA_RAM* _p, EXTID_UTYP* _tRecId, uint8_t frame)
{
	static uint16_t DataLen = 0;
	//------------------------------------------------------------------
	// 收到首帧
	//------------------------------------------------------------------
	if(_tRecId->st.packetID == 0)  DataLen = 0;
	//------------------------------------------------------------------
	// 接收数据
	//------------------------------------------------------------------
	rt_memcpy((uint8_t*)(can._std_msg[frame].CanBuffData + _tRecId->st.packetID * 8),
		_p->data.Data,
		_p->data.DLC);
	//------------------------------------------------------------------
	// 统计收到帧长
	//------------------------------------------------------------------
	DataLen += _p->data.DLC;
	//------------------------------------------------------------------
	// 收到尾帧
	//------------------------------------------------------------------
	if(_tRecId->st.packetID == ((can._std_msg[frame].len - 1) / 8))
	{
		//----------------------------------------------------------------
		// 帧长正确,更新数据
		//----------------------------------------------------------------
		if(DataLen == can._std_msg[frame].len)
		{
			can._std_msg[frame].update = 1;
		}
		//----------------------------------------------------------------
		// 清0帧长
		//----------------------------------------------------------------
		DataLen = 0;
	}
}

/****************************************************************
* Function Name  : StdMsgPush_sch
* Description    : 发送数据帧
*                   
* Input          : None
* Output         : None
* Return         : None
*****************************************************************/
void CanApp::CycleMsgPush(void)
{
	uint32_t ExtId = 0;
	uint16_t frameLen = 0;
	uint8_t Sendlen = 0;
	uint8_t ScanFrame = 0; 
	uint8_t frameCnt = 0;
	//-----------------------------------------------------------------
	// 扫描端口信息
	//------------------------------------------------------------------
	for(ScanFrame = 0; ScanFrame < CAN_STD_FRAME_NUM; ScanFrame++)
	{
		if(_std_msg[ScanFrame].direction == CAN_TX_DIRC)
		{
			if(++_std_msg[ScanFrame].clock < _std_msg[ScanFrame].sendTick)
				continue;
			else _std_msg[ScanFrame].clock = 0;
			
			if(_std_msg[ScanFrame].CanBuffData == RT_NULL)
				continue;
			//-----------------------------------------------------------------
			// 获取要发送端口数据长度
			//------------------------------------------------------------------
			frameLen = _std_msg[ScanFrame].len;
			//-----------------------------------------------------------------
			// 首帧帧编号
			//------------------------------------------------------------------
			frameCnt = 0;
			//-----------------------------------------------------------------
			// 拆包发送
			//------------------------------------------------------------------
			while (frameLen > 0)
			{
				//-----------------------------------------------------------
				// 计算本包数据长度
				//-----------------------------------------------------------
				if(frameLen > 8)
				{
					Sendlen = 8;
					frameLen -= 8;
				}
				else
				{
					Sendlen = frameLen;
					frameLen = 0;
				}

				ExtId = MakeCanMsgExtID(_std_msg[ScanFrame].direction,
					_std_msg[ScanFrame].FuncID,                           //功能号
					frameCnt,                                             //帧号
					_std_msg[ScanFrame].Dest,                             //宿端
					_std_msg[ScanFrame].Src                              //源端
					);

				CanApp_MakeTxAckMsg(ExtId,					                   	//扩展ID
					Sendlen,                                              //发送数据字节长度
					&_std_msg[ScanFrame].CanBuffData[frameCnt*8],         //要发送数据
					&_tCyc);                                              //发送缓冲区

				can_send_buffer(_std_msg[ScanFrame].canPort , &_tCyc);

				//-----------------------------------------------------------------
				// 维护帧编号
				//------------------------------------------------------------------
				frameCnt++;
			}
		}
	}
}


/****************************************************************
* Function Name  : StdTriggerMsgPush_sch
* Description    : 发送数据帧
*                   
* Input          : None
* Output         : None
* Return         : None
*****************************************************************/
void CanApp::TriggerMsgPush(void)
{
	uint32_t ExtId = 0;
	uint16_t frameLen = 0;
	uint8_t Sendlen = 0;
	uint8_t ScanFrame = 0; 
	uint8_t frameCnt = 0;

	//-----------------------------------------------------------------
	// 扫描端口信息
	//------------------------------------------------------------------
	for(ScanFrame = 0; ScanFrame < CAN_STD_FRAME_NUM; ScanFrame++)
	{
		if(_std_msg[ScanFrame].direction == CAN_ZX_DIRC)
		{			
			if(_std_msg[ScanFrame].update  == 0)
				continue;

			_std_msg[ScanFrame].update = 0;

			if((_std_msg[ScanFrame].CanBuffData == RT_NULL) && (_std_msg[ScanFrame].len > 0))
				continue;
			//-----------------------------------------------------------------
			// 获取要发送端口数据长度
			//------------------------------------------------------------------
			frameLen = _std_msg[ScanFrame].len;
			//-----------------------------------------------------------------
			// 首帧帧编号
			//------------------------------------------------------------------
			frameCnt = 0;
			//-----------------------------------------------------------------
			// 拆包发送
			//------------------------------------------------------------------
			while(frameLen > 0)
			{
				//-----------------------------------------------------------
				// 计算本包数据长度
				//-----------------------------------------------------------
				if(frameLen > 8)
				{
					Sendlen = 8;
					frameLen -= 8;
				}
				else
				{
					Sendlen = frameLen;
					frameLen = 0;
				}

				ExtId = MakeCanMsgExtID(_std_msg[ScanFrame].direction, //优先级
					_std_msg[ScanFrame].FuncID,                          //功能号
					frameCnt,                                            //帧号
					_std_msg[ScanFrame].Dest,                            //宿端
					_std_msg[ScanFrame].Src);                             //源端

