ekrats/SC0X_Monitor/bsp/stm32f40x/userApp/canApp.cpp
}

/*******************************************************************************
* Function Name  : void CanApp_CycleStream_Server(void)
* Description    : 负责 应用层与链路层 数据的定时更新
*                   
* Input          : None
* Output         : None
* Return         : None   xiangchuanyu
*******************************************************************************/
void CanApp_CycleStream_Server(void)
{
	static uint8_t TimeCnt = 0;
	
	//-----------------------------------------------------------
	// 更新CAN数据发送接收缓冲区
	//-----------------------------------------------------------
	can.CycleMsgUpdate_data();
	if(++TimeCnt >= 10)
	{
		TimeCnt = 0;
	}
	//-----------------------------------------------------------
	// 管理发送CAN数据帧
	//-----------------------------------------------------------
	can.CycleMsgPush();
}

/*******************************************************************************
* Function Name  : void CanApp_TriggerStream_Server(void)
* Description    : 负责 应用层与链路层 数据的定时更新
*                   
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CanApp_TriggerStream_Server(void)
{
	can.TriggerMsgPush();
}

/*******************************************************************************
* Function Name  : void cantx(uint8_t frame)
* Description    :
*                   
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SendCan(uint8_t frame)
{
	if(frame < CAN_STD_FRAME_NUM)
	{
		can.TriggerMsgUpdate_data(frame);
		Bsp_can_send_trigger_event();
	}
}

//================================================================
//Function Name: 
//Description  :BCH通讯初始化
//Input        : 
//Output       : 
//Return       : 
//================================================================
void gbch_init(void)
{
    can_services_init();
    can_rx_thread_init();
	can_thread_init();

	//---------------------------------------------------------------
	// 打开CAN控制器中断
	//---------------------------------------------------------------
#if(BSP_USE_CAN1 == 1)
	CAN_ITConfig(CAN1, CAN_IT_FMP0, ENABLE);
#endif

#if(BSP_USE_CAN2 == 1)
	CAN_ITConfig(CAN2, CAN_IT_FMP0, ENABLE);
#endif
}

void can_led(void)
{
	if(can.CanStateWord > 0)
	{
		stm32_hw_io_toggle(1);
	}
	else
	{
		stm32_hw_io_off(1);
	}
}

/*******************************************************************************
* Function Name  :  
* Description    :
*
*
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void can_fault(void)
{
	ScData * p = (ScData *)GetShareDataPtr();
	uint8_t portScan = 0;
	//------------------------------------------------------
	// 持续没有CAN没有接收到数据，判断CAN通讯丢失
	//------------------------------------------------------
	for(portScan = 0; portScan < 6; portScan++)
	{
		can.CanFltCnt[portScan]++;

		if(can.CanFltCnt[portScan] >= can.canOffTime)
		{
			can.CanFltCnt[portScan] = can.canOffTime;
			//-----------------------------------------------------
			// CAN接收1异常
			//-----------------------------------------------------
			can.CanStateWord &= ~(uint16_t)(0x0001 << portScan);
		}
		else
		{
			//-----------------------------------------------------
			// CAN接收1正常
			//-----------------------------------------------------
			can.CanStateWord |= (uint16_t)(0x0001 << portScan);
		}
	}
	
	p->status.status_bit.AdFault = (~can.CanStateWord) & 0x0020;
	can.CanCnt ++;
	
	if (can.CanCnt >= can.canOffTime)
	{
		can.CanCnt = can.canOffTime;
		p->status.status_bit.CanFault = 1; 
	}
	else
	{
		p->status.status_bit.CanFault = 0;
	}
}
